tutorials/heatTransfer/chtMultiRegionFoam/windshieldDefrost/0.orig/cabin/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.2;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 65;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.2;
        value           uniform 0.2;
    }

    symmetry
    {
        type            symmetryPlane;
    }

    walls
    {
        type            omegaWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        beta1           0.075;
        value           uniform 0.2;
    }

    cabin_to_ice
    {
        type            omegaWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        beta1           0.075;
        value           uniform 0.2;
    }
}


// ************************************************************************* //
